//Zavdany 1
let count = 0;
let ask = prompt('1.Українські фермери вирощують трюфелі. yes or no');
if(ask == 'yes'){
    console.log('1.Ви відповели правильно на перше питання');
    count++;
}
else if (ask === ''){
    console.log('1.Ви нічого не ввели ');
}
else if (ask == null){
    console.log('1.Ви скасували умову');
}
else{
    console.log('1.Ви ввели не правильну відповідь');
}
//---------------------------------------------------------------------------
ask = prompt('2.В Україні є найбільший у світі притулок для свійських тварин. yes or no');
if(ask == 'yes'){
    console.log('2.Ви відповели правильно на перше питання');
    count++;
}
else if (ask === ''){
    console.log('2.Ви нічого не ввели ');
}
else if (ask == null){
    console.log('2.Ви скасували умову');
}
else{
    console.log('2.Ви ввели не правильну відповідь');
}
//---------------------------------------------------------------------------
ask = prompt('3.Чи є в Україні крокодиляча ферма? yes or no');
if(ask == 'yes'){
    console.log('3.Ви відповели правильно на перше питання');
    count++;
}
else if (ask === ''){
    console.log('3.Ви нічого не ввели ');
}
else if (ask == null){
    console.log('3.Ви скасували умову');
}
else{
    console.log('3.Ви ввели не правильну відповідь');
}
//---------------------------------------------------------------------------
ask = prompt('4.На Київщині колорадських жуків шукають дрони. yes or no');
if(ask == 'yes'){
    console.log('4.Ви відповели правильно на перше питання');
    count++;
}
else if (ask === ''){
    console.log('4.Ви нічого не ввели ');
}
else if (ask == null){
    console.log('4.Ви скасували умову');
}
else{
    console.log('4.Ви ввели не правильну відповідь');
}
//---------------------------------------------------------------------------
ask = prompt('5.В Україні є лижна фабрика, яка покриває 40% європейського ринку. yes or no');
if(ask == 'no'){
    console.log('5.Ви відповели правильно на перше питання');
    count++;
}
else if (ask === ''){
    console.log('5.Ви нічого не ввели ');
}
else if (ask == null){
    console.log('5.Ви скасували умову');
}
else{
    console.log('5.Ви ввели не правильну відповідь');
}
//---------------------------------------------------------------------------
ask = prompt('6.Устриці вирощують і в Україні. yes or no');
if(ask == 'yes'){
    console.log('6.Ви відповели правильно на перше питання');
    count++;
}
else if (ask === ''){
    console.log('6.Ви нічого не ввели ');
}
else if (ask == null){
    console.log('6.Ви скасували умову');
}
else{
    console.log('6.Ви ввели не правильну відповідь');
}
//---------------------------------------------------------------------------
ask = prompt('7.В Україні є завод, який займається виготовленням крові. yes or no');
if(ask == 'yes'){
    console.log('7.Ви відповели правильно на перше питання');
    count++;
}
else if (ask === ''){
    console.log('7.Ви нічого не ввели ');
}
else if (ask == null){
    console.log('7.Ви скасували умову');
}
else{
    console.log('7.Ви ввели не правильну відповідь');
}
//---------------------------------------------------------------------------
ask = prompt('8.Україна - єдиний експортер кукурудзи до Єгипту. yes or no');
if(ask == 'yes'){
    console.log('8.Ви відповели правильно на перше питання');
    count++;
}
else if (ask === ''){
    console.log('8.Ви нічого не ввели ');
}
else if (ask == null){
    console.log('8.Ви скасували умову');
}
else{
    console.log('8.Ви ввели не правильну відповідь');
}
//---------------------------------------------------------------------------
ask = prompt('9.На Західній Україні є ферма, де розводять колібрі. yes or no');
if(ask == 'no'){
    console.log('9.Ви відповели правильно на перше питання');
    count++;
}
else if (ask === ''){
    console.log('9.Ви нічого не ввели ');
}
else if (ask == null){
    console.log('9.Ви скасували умову');
}
else{
    console.log('9.Ви ввели не правильну відповідь');
}
//---------------------------------------------------------------------------
ask = prompt('10.В Україні будують житло з конопель. yes or no');
if(ask == 'yes'){
    console.log('10.Ви відповели правильно на перше питання');
    count++;
}
else if (ask === ''){
    console.log('10.Ви нічого не ввели ');
}
else if (ask == null){
    console.log('10.Ви скасували умову');
}
else{
    console.log('10.Ви ввели не правильну відповідь');
}
//-----------------------------------------------------------------------------------------
if (count >= 0 && count <= 2){
    console.log(`Дуже погано , ви набрали ${count} балів`);
}
else if (count > 2 && count < 6){
    console.log(`Погано , ви набрали ${count} балів`);
}
else if (count > 5 && count < 9){
    console.log(`Добре, ви набрали ${count} балів`);
}
else if (count > 8){
    console.log(`Дуже добре, ви набрали ${count} балів`);
}

// //Zavdany 2
// let n = prompt("Write your name");
// if (n == ''){
//     console.log('Ви нічого не ввели ');
// }
// else if (n == null){
//     console.log('Ви скасували умову');
// }
// let password = prompt(`Hello ${n}, write password . (password = 1234)`);
// if(password == '1234'){
//     console.log('Ви війшли!')
// }
// else if (password === ''){
//     console.log('Ви нічого не ввели ');
// }
// else if (password === null){
//     console.log('Ви скасували умову');
// }
// else{
//     console.log('Ви ввели не правильний пароль')
// }

// //Zavdany 3
// let m = prompt('Введіть номер від 1 до 12')
// if (m == 1 || m == 2 || m == 12){
//     alert(`Місяць ${m} це Зима`);
// }
// else if (m > 2 && m < 6){
//     alert(`Місяць ${m} це Весна`);
// }
// else if (m > 5 && m < 9){
//     alert(`Місяць ${m} це Літо`);
// }
// else if (m > 8 && m <12){
//     alert(`Місяць ${m} це Осінь`);
// }
// else if (m === ''){
//     alert('Ви нічого не ввели ');
// }
// else if (m === null){
//     alert('Ви скасували умову');
// }
// else{
//     alert('Такого місяця не має')
// }
